## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # zentral_mdm_ota_enrollment.default will be updated in-place
  ~ resource "zentral_mdm_ota_enrollment" "default" {
        id                    = 1
      ~ name                  = "Default" -> "Default "
      ~ secret                = "0ATcRnTyeNFvj7hYF77Zw5Mk5VTz1DJimII3gj6kRYrosCi9AqoSgn39Tfr1jSYW" -> (known after apply)
      ~ serial_numbers        = [] -> (known after apply)
      ~ tag_ids               = [] -> (known after apply)
      ~ udids                 = [] -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>